#Задание 1
#Поработайте с переменными, создайте несколько, выведите на экран.
#Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.

name = 'Evgeniy'
age = 3
weight = 43
print (name, age, 'года', 'вес', weight, 'кг')

name = input ('Введите ваше имя: ')
age = int(input('Введите ваш возраст: '))
weight = int(input('Введите ваш вес: '))
condition = input('Введите ваше состояние: ')
print (name, age, 'год,', 'вес', weight, 'состояние:', condition)

#Задание 2
#Пользователь вводит время в секундах.
#Переведите время в часы, минуты, секунды и выведите в формате чч:мм:сс.
#Используйте форматирование строк.

time = int(input('Введите время в секундах: '))
hours = time//3600
minutes = (time%3600)/60
seconds = time%60
print ("%d:%d:%d" % (hours, minutes, seconds))

#Задание 3
#Узнайте у пользователя число n. Найдите сумму чисел n + nn + nnn.
#Например, пользователь ввёл число 3. Считаем 3 + 33 + 333 = 369.

n = int(input('Введите число: '))
first = n*10 + n
second = n*100 + first
print (n+first+second)

#Задание 4
#Пользователь вводит целое положительное число.
#Найдите самую большую цифру в числе. Для решения используйте цикл while и арифметические операции.

n = int(input('Введите число: '))
max = 0
while n > 0:
    if n % 10 > max:
        max = n % 10
    n//=10
print("Максимальное цифра в числе ", max)

#Задание 5
#Запросите у пользователя значения выручки и издержек фирмы.
# Определите, с каким финансовым результатом работает фирма.
# Например, прибыль — выручка больше издержек, или убыток — издержки больше выручки.
# Выведите соответствующее сообщение.
#Если фирма отработала с прибылью, вычислите рентабельность выручки.
# Это отношение прибыли к выручке.
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчёте на одного сотрудника.

revenue = int(input('Ввудите значение выручки: '))
costs = int(input('Ввудите значение издержек: '))
result = revenue - costs
if result <0:
    print ('Фирма работает в убыток')
elif result == 0:
    print("Фирма работает в ноль")
else:
    print (f"Фирма работает с прибылью. Рентабельность выручки составила: {result/revenue:.1f}")
    mans = int(input('Введите число сотрудников фирмы: '))
    print (f"Прибыль в расчете на одного сотрудника: {result/mans:.1f}")

#Задание 6
#Спортсмен занимается ежедневными пробежками.
# В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10% относительно предыдущего.
# Требуется определить номер дня, на который результат спортсмена составит не менее b километров.
# Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.

a = int(input("Введите результаты пробежки первого дня в км "))
b = int(input("Введите общий желаемый результат в км "))
day = 1
result = a
while result < b:
    day += 1
    a = 0.1*a + a
    result += a
print ('Вы достигнете требуемых показателей на ', day, 'день')

